week-02-first-order-logic-and-formal-systems/slides.tex
% Created 2023-04-24 Mon 17:10
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{default}
\author{Mathematical Logic Course}
\date{\today}
\title{Week 2: First-Order Logic and Formal Systems}
\hypersetup{
 pdfauthor={Mathematical Logic Course},
 pdftitle={Week 2: First-Order Logic and Formal Systems},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:org1654622}]{Overview}
\begin{itemize}
\item Introduction to first-order logic
\item Syntax and semantics of first-order logic
\item Formal systems: axioms, rules of inference, proofs
\item Formalizing mathematical theories (e.g., Peano arithmetic)
\item Coding exercises
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org0ac0698}]{Introduction to First-Order Logic}
\begin{itemize}
\item Extension of propositional logic with quantifiers
\item Allows for reasoning about objects and their properties
\item Quantifiers: universal (\(\forall\)) and existential (\(\exists\))
\item Example: \(\forall x, P(x)\)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org0e20fcb}]{Syntax and Semantics}
\begin{itemize}
\item Syntax: rules for constructing well-formed formulas
\item Semantics: rules for interpreting formulas
\item Terms, predicates, and quantifiers
\item Example: \(\forall x, P(x) \Rightarrow Q(x)\)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org623705a}]{Formal Systems}
\begin{itemize}
\item Axioms: foundational statements assumed to be true
\item Rules of inference: rules for deriving new statements from existing ones
\item Proofs: sequences of steps leading to a conclusion
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org980310c}]{Formalizing Mathematical Theories}
\begin{itemize}
\item Example: Peano arithmetic
\item Axioms for the natural numbers
\item Defining addition, multiplication, and other operations
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org3d91fad}]{Coding Exercises}
\begin{itemize}
\item Building a simple theorem prover for propositional logic in Python
\item Representing first-order formulas and evaluating them
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org97cf780}]{Summary and Next Steps}
\begin{itemize}
\item We learned the basics of first-order logic and formal systems
\item Next topic: Computability and Turing machines
\item Coding exercises to reinforce concepts
\end{itemize}
\end{frame}
\end{document}